Revit 2027 API
Space.LimitOffset Property
Get or set the Limit Offset of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LimitOffset { get; set; }
Public Property LimitOffset As Double
	Get
	Set
public:
property double LimitOffset {
	double get ();
	void set (double value);
}
member LimitOffset : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Limit Offset of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace